# Индивидуальное задание
# Вариант 6
# Ворончихина Евгения ЭУ-142
# Задача №1
print('Индивидуальное задание. Задача№1')
import numpy as np# импортируем библиотеку
# --# исходные данные myA
myA=np.array([[1.42,1.4,1.88],[1.79,1.02,1.49],[1.43,1.91,1.65]])
# --# исходные данные myB
myB=np.array([0.17,0.41,0.99])
# --# вывод системы на экран
print(myA[0,],"*X1=",myB[0])
print(myA[1,],"*X2=",myB[1])
print(myA[2,],"*X3=",myB[2])
slv = np.linalg.solve(myA, myB)
print("Решение=", slv)

print('Индивидуальное задание. Задача№2')
import numpy as np# импортируем библиотеку
# --# исходные данные myA
myA=np.array([[1.64,1.14,1.54,1.96,1.86,1.92],
              [1.55,1.07,1.54,1.57,1.75,1.09],
              [1.94,1.50,1.16,1.49,1.79,1.07],
              [1.71,1.39,1.33,1.68,1.22,1.44],
              [1.72,1.68,1.51,1.78,1.82,1.85],
              [1.5,1.5,1.77,1.37,1.98,1.37]])
# --# исходные данные myB
myB=np.array([0.55,0.10,0.38,0.52,0.02,0.22])
# --# вывод системы на экран
print(myA[0,],"*X1=",myB[0])
print(myA[1,],"*X2=",myB[1])
print(myA[2,],"*X3=",myB[2])
print(myA[3,],"*X4=",myB[3])
print(myA[4,],"*X5=",myB[4])
slv = np.linalg.solve(myA, myB)
print("Решение=", slv)

print('Индивидуальное задание. Задача№3')
import numpy as np# импортируем библиотеку
# --# исходные данные myA
myA=np.array([[1.36,1.37],[1.38,1.90]])
# --# исходные данные myB
myB=np.array([0.51,0.23])
# --# вывод системы на экран
print(myA[0,],"*X1=",myB[0])
print(myA[1,],"*X2=",myB[1])
slv = np.linalg.solve(myA, myB)
print("Решение=", slv)

print('Индивидуальное задание. Задача№4')
import numpy as np# импортируем библиотеку
# --# исходные данные myA
myA=np.array([[1.26,1.01],[1.49,1.17]])
# --# исходные данные myB
myB=np.array([0.08,0.70])
# --# вывод системы на экран
print(myA[0,],"*X1=",myB[0])
print(myA[1,],"*X2=",myB[1])
slv = np.linalg.solve(myA, myB)
print("Решение=", slv)

print('Индивидуальное задание. Задача№5')
import numpy as np# импортируем библиотеку
# --# исходные данные myA
myA=np.array([[1.2,1.74,1.15,1.58,1.69,1.46],
              [1.64,1.95,1.11,1.63,1.05,1.62],
              [1.14,1.65,1.74,1.77,1.14,1.49],
              [1.52,1.79,1.92,1.83,1.52,1.01],
              [1.39,1.05,1.08,1.49,1.22,1.92],
              [1.13,1.62,1.12,1.21,1.60,1.81]])
# --# исходные данные myB
myB=np.array([0.82,0.20,0.68,0.32,0.99,0.52])
# --# вывод системы на экран
print(myA[0,],"*X1=",myB[0])
print(myA[1,],"*X2=",myB[1])
print(myA[2,],"*X3=",myB[2])
print(myA[3,],"*X4=",myB[3])
print(myA[4,],"*X5=",myB[4])
print(myA[5,],"*X6=",myB[5])
slv = np.linalg.solve(myA, myB)
print("Решение=", slv)